echo off
chcp 65001
cls
rem 0. Перейти в каталог с исходниками
cd source
echo _
echo ================= 1. Скомпилировать список файлов ===================
..\bin\oc /B Buildfile
echo _
echo ================= 2. Скопировать на место существующих ================
copy .\*.exe ..\bin
copy .\*.dll ..\bin
echo _
echo ================ 3. Ещё раз скомпилировать ========================
..\bin\oc /B Buildfile
echo ================ 4. Удаляю старые файлы ========================
del .\*.exe
del .\*.dll
cd ..
echo on
